tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
tap "homebrew/services"
tap "trojan-gfw/trojan"

brew "autojump"
brew "bat"
brew "go"
brew "diff-so-fancy"
brew "ctop"
brew "exa"
brew "fish"
brew "fzf"
brew "htop"
brew "httpie"
brew "mycli"
brew "mysql"
brew "neovim"
brew "node"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "yadm"
brew "trojan"

cask "google-chrome"
cask "sogouinput"
cask "alacritty"
cask "neteasemusic"
cask "wechat"
cask "wechatwork"
cask "docker"
cask "miniconda"
cask "typora"
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "teamviewer"
cask "telegram"
cask "youdaodict"
